{
  "broadArea": {
    "name": "Electronics and Communication Engineering",
    "link": "https://www.vlab.co.in/broad-area-electronics-and-communications",
    "code": "ECE"
  },
  "lab": "Embedded System Design with 8051 and PIC Microcontroller",
  "lab_display_name": "Embedded System Design with 8051 and PIC Microcontroller",
  "phase": "3-ext",
  "collegeName": "COEP",
  "baseUrl": "esd-coep.vlabs.ac.in",
  "introduction": "Embedded System is fast growing research area and microcontrollers are an integral part of each embedded system. Microcontrollers are small computers mainly used to provide automation and intelligence in the embedded systems. In this virtual laboratory, students will gain a comprehensive understanding of embedded systems development using PIC18 series Microcontrollers. They will explore the details about functioning of clock, I/O pins, I/O interfaces like LED, Switch, on-ship interfaces like, Times/Counters, ADC, PWM etc.<br>The virtual lab will give students great experience of understanding embedded-c programming, for various I/O and on-chip interfaces. Students can even download the auto generated programs and test them for the Microchip IDE for further embedded system development. Lab provides a robust foundation for overall understanding of PIC18 series Microcontroller and bridges the gap between academic theory and real-time development.",
  "experiments":[
    {
        "name": "Programming for Delay Generation and Effect of CPU Clock",
        "short-name": "delay-generation-effect",
        "repo": "https://github.com/virtual-labs/exp-delay-generation-and-effect-coep",
        "tag": "v1.0.0",
        "deploy": true
    },
    {
        "name": "Programming for I/O Interfacing (LED and Switch Interfacing)",
        "short-name": "io-interfacing-led-switch",
        "repo": "https://github.com/virtual-labs/exp-i-o-interfacing-coep",
        "tag": "v1.0.0",
        "deploy": true
    },
    {
        "name": "Programming with On-Chip Timers/Counters",
        "short-name": "on-chip-timers-counters",
        "repo": "https://github.com/virtual-labs/exp-on-chip-timers-counters-coep",
        "tag": "v1.0.0",
        "deploy": true
    },
    {
        "name": "Programming with On-Chip ADC",
        "short-name": "on-chip-adc",
        "repo": "https://github.com/virtual-labs/exp-on-chip-adc-coep",
        "tag": "v1.0.0",
        "deploy": true
    },
    {
        "name": "Programming for PWM Generation",
        "short-name": "pwm-generation",
        "repo": "https://github.com/virtual-labs/exp-pwm-generation-coep",
        "tag": "v1.0.0",
        "deploy": true
    }
],
  "targetAudience": {
    "UG": [
      "UG (2nd Year and 3rd year students) 4th Semester, 5th Semester and 6th Semester of ECE, Computer Sciences and Engineering, Instrumentation Engineering, Electrical Engineering, Electronics and Telecommunication Engineering, etc"
    ],
    "PG": []
  },
  "objective": "The virtual lab provides a detailed understanding of the PIC18 series microcontroller. It also offers a comprehensive insight into various features and techniques:<br><ul><li>The architecture details and CPU timing of Microchip PIC series Microcontrollers</li><li>Embedded-C programming and to get coding experience with PIC18 series microcontrollers</li><li>The real-time interfacing of I/O devices, Timers, analog/digital sensors, PWM generation for actuators to develop the embedded systems.</li><li>With the rise of edge of IoT, Robotics and Industrial Automation, the knowledge of Microcontrollers can allow students to build and design the systems required for such applications.</li></ul>",
  "courseAlignment": {
    "description": "The syllabi of this lab aligns to the following universities in India.",
    "universities": [
      "Pondicherry University – Course Name- MICROCONTROLLER BASED SYSTEM DESIGN (P14EST104), UG",
      "Gujrat Technological University- Course Name- MICROCONTROLLERS AND EMBEDDED SYSTEMS (2172001), UG",
      "Punjab Technical university Jalandhar – Course Name- MICROCONTROLLER BASED EMBEDDED SYSTEM DESIGN (PD104), UG",
      "University of Mumbai- Course Name- Microcontrollers (ECC402), UG",
      "Shivaji University, Kolhapur, Course Name- Microcontroller and Its Applications, UG"
    ]

 
}
}
